app/controllers/tests_controller.rb

  def new
    @test = Test.new
    @test_types = TestType.first
    @questions = Question.all
    @question1 = Question.find(1)
---
SELECT  "test_types".* FROM "test_types" ORDER BY "test_types"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "questions".* FROM "questions"
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @test = Test.create(test_params)
    @test.questions << Question.find(1)
---
INSERT INTO "tests" ("created_at", "updated_at", "test_type_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", 2016-10-26 12:09:53 UTC], ["updated_at", 2016-10-26 12:09:53 UTC], ["test_type_id", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def show
    @test = Test.find(params[:id])
---
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]