app/views/tests/new.html.haml

  = f.text_field(:test_url, placeholder: "URL for testing")
  = f.select :test_type, options_for_select(@test_types.map{ |t| [t.description, t.id] })
  = f.select :questions, options_for_select(@questions.map{ |q| [q.text, q.id] })
---
SELECT  "test_types".* FROM "test_types" ORDER BY "test_types"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "questions".* FROM "questions"